[
    {
        "_id": "64034c117a7b57f9573e7e18",
        "plant_name": "soyabean",
        "short_info": "soybean, (Glycine max), also called soja bean or soya bean, annual legume of the pea family (Fabaceae) and its edible seed. The soybean is economically the most important bean in the world, providing vegetable protein for millions of people and ingredients for hundreds of chemical products.",
        "avg_len": "2 meter         (6.2 feet)",
        "cultivation": "First fortnight of June is best time for sowing Soybean. Spacing. While sowing use row to row spacing of 45 cm and plant to plant spacing of 4-7 cm. Sowing Depth. Sow seeds at depth of 2.5-5 cm.",
        "diseases": "Several diseases, including Phytophthora root and stem rot, pod and stem blight, frogeye leaf spot, brown spot, downy mildew, Cercopsora leaf blight and purple seed stain, and Sclerotinia stem rot (white mold), are known to affect soybeans",
        "fertilizer": "pottasium & phosphorus fertilizer",
        "is_it_creeper": "yes",
        "pesticides": "Baythroid® XL. Bayer's Baythroid XL insecticide is the complete pyrethroid for many crops, and offers fast, effective control of pests in soybeans.",
        "pre_plant_process": "1) Field preparation                     2)Seed Treatment with fungicides                       3)fertilizer application               4)Seed treatment with fertilizer",
        "plantation_process": "Mid-June is the best time for sowing soybean. Seeds should be sown by seed drill method in rows spacing 45-50 cm. And seeds spacing between 4-7 cm. Seed rate of 25-30 kg is preferred for sowing in 1-acre land.",
        "time_span": "3 to 4 months",
        "image": "soyabean.jpg"
    },
    {
        "_id": "64034c117a7b57f9573e7e19",
        "plant_name": "Moong",
        "short_info": "The mung bean is mainly cultivated in East, Southeast and South Asia.It is used as an ingredient in both savoury and sweet dishes .It is Also known as Green Gram.The green gram is an annual vine with yellow flowers and fuzzy brown pods.The English word mung is originated from the Hindi word mūṅg , which is derived from the Sanskrit word mudga .",
        "avg_len": "15-125 cm",
        "cultivation": "Mung bean is a warm season and frost-intolerant plant. Mung bean is suitable for being planted in temperate, sub-tropical and tropical regions. The most suitable temperature for mung bean's germination and growth is 15-18 °C. Mung bean has high adaptability to various soil types, while the best pH of the soil is between 6.2 and 7.2. Mung bean is a short-day plant and long days will delay its flowering and podding",
        "diseases": "Mungbean yellow mosaic disease (MYMD) is a significant viral disease of mung bean, which causes severe yield losses annually. MYMD is caused by three distinct begomoviruses, transmitted by whitefly. The economic losses due to MYMD account for up to 85% yield reduction in India",
        "fertilizer": "Biofertilizer viz. Rhizobium...Chemical Fertilizer: Phosphorus",
        "is_it_creeper": "true",
        "pre_plant_process": "For Organic Moong Dal Cultivation, there is no need for seedbed preparation and 1 or 2 ploughings followed by harrowing is enoguh for this crop. Moong dal is cultivated on deep soils. For the moong dal crop, no-tillage is needed which is used as rice follow as the seed is broadcasted in a standing crop of rice around a week before its harvest. Tillage assures the through mixing fertilizers, pesicides, and manures in the soil. It avoids the growth of thw weeds and helps in seed germination, deep percolations of roots, avoids soil erosion, and holds the soil moisture. Tillage is the most important part o land preparation.",
        "plantation_process": "Optimum time for kharif sowing is first fortnight of July. Optimum time for summer moong cultivation is from March to April.Use row spacing of 30 cm and plant to plant spacing of 10 cm for Kharif sowing. For Rabi sowing use row spacing of 22.5 cm and plant to plant spacing of 7 cm. Sow seeds at depth of 4-6 cm.For sowing drill/pora/kera methods are used.",
        "time_span": "80 to 85 Days",
        "image": "moong.jpg"
    },
    {
        "_id": "64034c117a7b57f9573e7e1a",
        "plant_name": "cotton",
        "short_info": "Cotton plant is a shrub and is widely cultivated in over 90 countries for its fiber and secondly for seeds. About 2,5% of world cropland is planted with cotton. It is an angiosperm, dicotyledonous plant, which belongs to the family of Malvaceae. It is native to Asia and Africa. This means that we sow the seeds during spring, we harvest the cotton during autumn, and then we plow and destroy the plants, so that we can sow again next spring in an empty field.",
        "avg_len": "Short staple cotton : 95cm to 2.4cm  Medium stapable cotton : (2.54cm to 2.86cm) Long-staple cotton : 3cm to 6.35cm",
        "cultivation": "Cotton cultivation is usually associated with the use of chemicals, and the runoff water contains nutrients, salts and pesticides. Excess irrigation compared with ET requirements and leaching of water to maintain salinity create favourable conditions for groundwater pollution.",
        "diseases": "Fusarium wilt",
        "fertilizer": "most commonly used fertilizer nitrogen",
        "pesticides": "aldicarb, phorate, methamidophos and endosulfan",
        "pre_plant_process": "Cotton is sown on ridges and furrows. For irrigated cotton the land is given a deep ploughing followed by two harrowings. Ridges and furrows having different spacing for irrigated and rainfed cotton. For irrigated cotton shallow ridges on 90cm spacing should be prepared which helps in irrigation.",
        "plantation_process": "The first phase is land clearing for soil preparation and weed removal.\n2)Cotton seeds are either planted by hand or by machinery.\n3)In 11 days, the full cotton stand will emerge and must be secured from disease attacks. It is important to provide adequate fertiliser and irrigation.\n4)After 6 weeks, flower buds start developing and the pod emerges after it falls off, which is often called a cotton boll.\n5)Within 55 to 80 days, Boll matures and produces fibres from the pods that continue to develop.\n6)The leaves have now been removed from the cotton plant.\n7)The next step is manual harvesting by machines such as pickers/strippers. To pull the cotton from the plant, the picker system uses wind & guides, leaving behind leaves & the rest of the plant. To separate garbage from the cotton, the stripper device chops the plant & uses air.\n8)To separate soil, seeds & short lint from the cotton, the cotton is washed.\n9)Cleaned & de-seeded cotton is compressed for further processing & transportation for economical storage.",
        "time_span": "150 to 180 days",
        "image": "cotton.jpg"
    },
    {
        "_id": "64034c117a7b57f9573e7e1b",
        "plant_name": "Chickpea",
        "short_info": "The chickpea or chick pea (Cicer arietinum) is an annual legume of the family Fabaceae, subfamily Faboideae.Its different types are variously known as gram or Bengal gram, garbanzo or garbanzo bean, or Egyptian pea.Chickpea seeds are high in protein. It is one of the earliest cultivated legumes, and 9500-year-old remains have been found in the Middle East.",
        "avg_len": "14 inches to 22 inches and from 10 inches to 20 inches with Desi types.",
        "cultivation": "Chickpea crop grows well under good moisture conditions with ideal temperature between 24°C and 30°C. Chickpeas are cultivated under both irrigated and rainfall conditions.Basically this crop is winter season crop. This crop does not tolerate frost especially flowering stage as this will damage the sed developement in the pod. Annually 65 to 95 cm rainfall required for its cultivation.",
        "diseases": "Wilt, Grey Mold, Sclerontinia Blight, Rust and Ascochyta Blight are the main diseases in chickpea farming.",
        "fertilizer": "Nitrogen, Phosphorus and diammonium phosphate",
        "is_it_creeper": "No",
        "pesticides": "CutWorms and pod Borer are main pests in chickpea farming. To control the cutworms,apply Lindane 6% granules @20t to 30kg/ha mixed in the soil. To control the Pod Borer,apply spray of Endisulfan 35 EC at the rate of 1.30 litres mixed in 900-1000 litres of water/ha.",
        "pre_plant_process": "Field preparation in chickpea farming is based on type of the soil and cropping system followed. In case of a heavy soil, a rough seedbed should be prepared to avoid packing of the cloddy surface due to winter rains and to accommodate and easy seedling germination. If chickpea is cultivated as a mixed crop with other cereal crops, the land should be ploughed to a fine tilth. Deep ploughing with tractor or desi plough is required in the field before monsoon starts. This will retain suffcient moisture in the soil beds.",
        "plantation_process": "Make 1.5- to 2-inch deep holes 3 to 4 inches apart, drop a seed in each one, and cover them with soil. Water should be provided regularly. Like Productivity, planting the seeds with proper depth and distance is very important.",
        "time_span": "100 Days",
        "image": "chickpea.jpg"
    },
    {
        "_id": "64034c117a7b57f9573e7e1c",
        "plant_name": "sesame",
        "short_info": "sesame, (Sesamum indicum), also called benne, erect annual plant of the family Pedaliaceae, grown since antiquity for its seeds, which are used as food and flavouring and from which a prized oil is extracted.",
        "avg_len": "3-5 feet",
        "cultivation": "in India the sesame crop is cultivated as kharif, summer.Place the seed 1/2 inch to 3/4 inch below the defined\r\nmoisture line with a 1/4 inch to 3/4 dry covering of dry\r\nsoil above that line. The total seeding depth would\r\nbe from 3/4 inch to 1.5 inches.\r\n If a planting rain follows a drought, make sure that\r\nthe top moisture has joined the bottom moisture.\r\nNo root will push through dry dirt.\r\n Needs moisture around seed 3 days (late\r\nplanting/warmer) to 5 days (early planting/cooler).\r\n Do not fill boxes above 6-8” because will grind\r\nseed",
        "diseases": "Phyllody.\nDry root rot.\nPhytophthora blight.\nAlternaria blight.\nIPM for Sesame.",
        "fertilizer": "Sesame does not require much fertilizer except where the soil is very poor. The recommended rate of 50 kg N / ha + 60 kg P₂O₅ /ha + 35 K₂O kg/ha is required. Therefore, 3 bags of NPK fertilizer (15:15:15) should be applied at planting and 2 bags of Urea should be applied at juvenile stage.",
        "pesticides": "Spray neem seed kernels extract (NSKE) 5% or dimethoate 30EC@ 1.5 ml/l or oxydemeton methyl 25EC @ 1.5ml/or imidacloprid 17.8SL @ 0.3 ml/l or acetamiprid 20SP @ 0.3 g/l or thiamethoxam 25WG @ 0.3 g/l or thiacloprid 21.7 SC @ 1 ml/l.",
        "pre_plant_process": "The land should be ploughed by tractor or desi/country plough and harrowed repeatedly for bridging the soil to fine tilth and weed free for quick germination as the sesame seeds are small.",
        "plantation_process": "Place the seed 1/2 inch to 3/4 inch below the defined moisture line with a 1/4 inch to 3/4 dry covering of dry soil above that line. The total seeding depth would be from 3/4 inch to 1.5 inches.  If a planting rain follows a drought, make sure that the top moisture has joined the bottom moisture. No root will push through dry dirt.  Needs moisture around seed 3 days (late planting/warmer) to 5 days (early planting/cooler).  Do not fill boxes above 6-8” because will grind seed.",
        "time_span": "100-110 days",
        "image": "sesame.jpg"
    },
    {
        "_id": "64034c117a7b57f9573e7e1d",
        "plant_name": "Black Gram",
        "short_info": "Black gram originated in South Asia, where it has been in cultivation from ancient times and is one of the most highly prized pulses of India. It is very widely used in Indian cuisine. In India the black gram is one of the important pulses grown in both Kharif and Rabi seasons. This crop is extensively grown in southern part of India, northern part of Bangladesh and Nepal.",
        "avg_len": "30-100 cm",
        "cultivation": "Black gram can be grown on variety of soils ranging from sandy soils to heavy cotton soils. The most ideal soil is a well drained loam with pH of 6.5 to 7.8. Black gram cannot be grown on alkaline and saline soils. Land is prepared like any other kharif season pulse crop.",
        "diseases": "YM virus , Leaf Curl, Seed/Seedling rot, Anthracnose, Hairy Caterpillar, Leaf Hopper",
        "fertilizer": "Apply 20-30 kg/ha of nitrogen, 30-40 kg/ha of phosphorus, and 20-30 kg/ha of potassium as basal fertilizers.",
        "is_it_creeper": "Yes",
        "pesticides": "Carbendazim, Imidacloprid, Chlorpyrifos, Profenofos, Acephate, Mancozeb  These are the major pesticides.",
        "pre_plant_process": "1.Land should be ploughed in summer followed by two to three harrowing at pre-monsoon for kharif season.\n2. For summer black gram, after harvest of rabi crops, field prepare with criss-cross moghda once followed by two harrowing\n3. Land should be well leveled.\n4. Collect the weeds, previous crops stubbles, stones and clean the field for sowing.\n5. Mix five to six tons of FYM or compost at last harvesting.\n6. If necessary, one pre-sowing irrigation should be given.",
        "plantation_process": "Plant the seeds at a depth of 3-4 cm and maintain a spacing of 30-40 cm between the rows. The recommended sowing time for black chana is from mid-October to mid-November.",
        "time_span": "90 to 120 Days",
        "image": "black-gram.jpg"
    },
    {
        "_id": "64034c117a7b57f9573e7e1e",
        "plant_name": "fennel",
        "short_info": "Fennel (Foeniculum vulgare) is a flowering plant species in the carrot family. It is a hardy, perennial herb with yellow flowers and feathery leaves.It is indigenous to the shores of the Mediterranean but has become widely naturalized in many parts of the world, especially on dry soils near the sea-coast and on riverbanks.",
        "avg_len": "60 to 180 cm (2 to 6 feet)",
        "cultivation": "Fennel prefers well-drained soil that is rich in organic matter. Before planting, work in plenty of compost or well-rotted manure to improve soil fertility and drainage.",
        "diseases": "Leaf (Ramularia) blight, Leaf spot, Damping off, Fusarium wilt, Collar rot",
        "fertilizer": "Nitrogen, Phosphorus--rich fertilizers.",
        "is_it_creeper": "-",
        "pesticides": "Aphid, Thrips, Cutworm, Drug Store bettle.",
        "pre_plant_process": "Fennel prefers soil that is rich in organic matter and has a pH between 6.0 and 7.0. Add compost or well-rotted manure to the soil to improve its fertility and texture. Remove any rocks, weeds, or debris from the planting area.",
        "plantation_process": "Fennel can be grown from seeds or transplants. If starting from seeds, sow them directly into the prepared soil in the spring or fall, abouti 1 /4 inch deep and 12-18 inches apart. Water the soil lightly after sowing.",
        "time_span": "90 to 120 Days",
        "image": "fennel.jpg"
    }
]