[
    {
        "_id": "64036b82838fe82feec8b7c9",
        "crop": "64034c117a7b57f9573e7e1a",
        "name": "Ajit 155 BG 2",
        "short_info": "Ajit 155 BG 2 is a genetically modified Bt cotton variety developed by Mahyco Monsanto Biotech (India) Private Limited. It is known for its high yield potential and resistance to bollworms.",
        "avg_length": "3-4 feet.",
        "is_it_creeper": "No",
        "land_preparation": "The land for cultivating Ajit 155 BG 2 should be prepared by plowing, harrowing, and leveling. The soil should be well-drained, fertile, and rich in organic matter.",
        "seed_treatment": "Fungicides, pesticides and Bio-fertilizers are some of the seed treatment used for Ajit BG 2 cotton",
        "sowing": "The seeds of Ajit 155 BG 2 should be sown at a spacing of 60 x 45 cm, 2-3 seeds per hill, and a depth of 2-3 cm.",
        "irrigation": "Ajit 155 BG 2 requires regular irrigation, especially during the early growth stages. Irrigation should be done based on the soil and weather conditions.",
        "fertilizer_application": "A basal dose of 60 kg N, 30 kg P2O5, and 30 kg K2O per acre is recommended for Ajit 155 BG 2. The fertilizers should be applied based on the soil test recommendations or as per the local recommendations.",
        "weed_control": "Weeds should be controlled manually or chemically with recommended herbicides.",
        "pesticides": "Pesticides should be used as per the recommendations for controlling bollworms, pink bollworms, and other pests.",
        "diseases": "Ajit 155 BG 2 is susceptible to diseases such as Fusarium wilt, Alternaria leaf spot, and Verticillium wilt. Proper disease management practices should be followed to prevent these diseases.",
        "harvesting": "Ajit 155 BG 2 cotton bolls should be harvested when they are mature and ready for picking, which usually starts around 150-160 days after sowing. The cotton should be stored in a cool and dry place after harvesting."
    },
    {
        "_id": "64036b82838fe82feec8b7ca",
        "crop": "64034c117a7b57f9573e7e1a",
        "name": "Ankur 3028 BG 2",
        "short_info": "Ankur 3028 BG 2 is a genetically modified cotton variety that is designed to resist pests and diseases. It is engineered with Bollgard 2 technology, providing protection against major cotton pests like bollworm, pink bollworm, and spodoptera.",
        "avg_length": "Around 28-30 mm",
        "is_it_creeper": "No",
        "land_preparation": "The land for cultivating Ankur 3028 BG 2 should be prepared by plowing, harrowing, and leveling. The soil should be well-drained, fertile, and rich in organic matter.",
        "seed_treatment": "The Ankur 3028 BG 2 seeds should be treated with recommended fungicides and insecticides to protect them from soil-borne diseases and pests.",
        "sowing": "The seeds of Ankur 3028 BG 2 should be sown at a spacing of 60 x 45 cm, 2-3 seeds per hill, and a depth of 2-3 cm.",
        "irrigation": "Ankur 3028 BG 2 requires regular irrigation, especially during the early growth stages. Irrigation should be done based on the soil and weather conditions.",
        "fertilizer_application": "A basal dose of 60 kg N, 30 kg P2O5, and 30 kg K2O per acre is recommended for Ankur 3028 BG 2. The fertilizers should be applied based on the soil test recommendations or as per the local recommendations.",
        "weed_control": "Weeds should be controlled manually or chemically with recommended herbicides.",
        "pesticides": "Pesticides should be used as per the recommendations for controlling bollworms, pink bollworms, and other pests.",
        "diseases": "Ankur 3028 BG 2 is susceptible to diseases such as Fusarium wilt, Alternaria leaf spot, and Verticillium wilt. Proper disease management practices should be followed to prevent these diseases.",
        "harvesting": "Ankur 3028 BG 2 cotton bolls should be harvested when they are mature and ready for picking, which usually starts around 150-160 days after sowing. The cotton should be stored in a cool and dry place after harvesting."
    },
    {
        "_id": "64036b82838fe82feec8b7cb",
        "crop": "64034c117a7b57f9573e7e1a",
        "name": "Kaveri ATM BG 2",
        "short_info": "Kaveri ATM BG 2 is a genetically modified cotton variety that is designed to resist pests and diseases.  This cotton variety has high yield potential and good fiber quality.",
        "avg_length": "Around 27-28 mm",
        "is_it_creeper": "No",
        "land_preparation": "Clear the field, Plow the field, Apply fertilizers and soil amendments, Create furrow, then Irrigation.",
        "seed_treatment": "The Ankur 3028 BG 2 seeds should be treated with recommended combination treatment, chemical treatment, physical treatment, fungicides and insecticides to protect them from soil-borne diseases and pests.",
        "sowing": "The seeds should be planted at a depth of 2-3 cm in the furrows created during land preparation.Density for Kaveri ATM BG 2 cotton is typically around 10-12 plants per meter of row, with a row spacing of 75-90 cm",
        "irrigation": "There are several methods of irrigation that can be used for Kaveri ATM BG 2 cotton, including flood, furrow, sprinkler, and drip irrigation.",
        "fertilizer_application": "Kaver ATM BG 2 Cotton requires several macronutrients, including nitrogen (N), phosphorus (P), and potassium (K). The specific fertilizer requirements will depend on the soil test results and other factors.",
        "weed_control": "Weeds should be controlled manually or chemically with recommended herbicides.",
        "pesticides": "Pesticides should be used as per the recommendations for controlling bollworms, pink bollworms, and other pests.",
        "diseases": "Kaveri ATM BG 2 is susceptible to diseases such as Fusarium wilt, Verticillium wilt, Cotton leaf curl virus, Alternaria leaf spot.roper disease management practices should be followed to prevent these diseases.",
        "harvesting": "Kaveri ATM BG 2 Cotton bolls should be harvested when they are fully mature and have opened, revealing the white cotton fibers inside.: After harvesting, the cotton should be transported and stored in a dry, clean environment."
    },
    {
        "_id": "64036b82838fe82feec8b7cc",
        "crop": "64034c117a7b57f9573e7e1a",
        "name": "Kaveri Bullet KCH 707 BG II",
        "short_info": "Kaveri Bullet KCH 707 BG II is a genetically modified Bt cotton variety developed by Kaveri Seeds. It is known for its high yield potential, early maturity, and resistance to bollworms.",
        "avg_length": "4-5 feet",
        "is_it_creeper": "No",
        "land_preparation": "The land for cultivating Kaveri Bullet KCH 707 BG II should be prepared by plowing, harrowing, and leveling. The soil should be well-drained, fertile, and rich in organic matter.",
        "seed_treatment": "The Kaveri Bullet KCH 707 BG II seeds should be treated with recommended fungicides and insecticides to protect them from soil-borne diseases and pests.",
        "sowing": "The seeds of Kaveri Bullet KCH 707 BG II should be sown at a spacing of 67.5 x 45 cm, 2-3 seeds per hill, and a depth of 2-3 cm.",
        "irrigation": "Kaveri Bullet KCH 707 BG II requires regular irrigation, especially during the early growth stages. Irrigation should be done based on the soil and weather conditions.",
        "fertilizer_application": "A basal dose of 100 kg N, 50 kg P2O5, and 50 kg K2O per acre is recommended for Kaveri Bullet KCH 707 BG II. The fertilizers should be applied based on the soil test recommendations or as per the local recommendations.",
        "weed_control": "Weeds should be controlled manually or chemically with recommended herbicides.",
        "pesticides": "Pesticides should be used as per the recommendations for controlling bollworms, pink bollworms, and other pests.",
        "diseases": "Kaveri Bullet KCH 707 BG II is susceptible to diseases such as Fusarium wilt, Alternaria leaf spot, and Verticillium wilt. Proper disease management practices should be followed to prevent these diseases.",
        "harvesting": "Kaveri Bullet KCH 707 BG II cotton bolls should be harvested when they are mature and ready for picking, which usually starts around 145-150 days after sowing. The cotton should be stored in a cool and dry place after harvesting."
    },
    {
        "_id": "64036b82838fe82feec8b7cd",
        "crop": "64034c117a7b57f9573e7e1a",
        "name": "Mahyco Chaitanya 7377 BG II",
        "short_info": "Mahyco Chaitanya 7377 BG II is a genetically modified Bt cotton variety developed by Maharashtra Hybrid Seeds Company (Mahyco). It is known for its high yield potential, early maturity, and resistance to bollworms.",
        "avg_length": "4-5 feet.",
        "is_it_creeper": "No",
        "land_preparation": "The land for cultivating Mahyco Chaitanya 7377 BG II should be prepared by plowing, harrowing, and leveling. The soil should be well-drained, fertile, and rich in organic matter.",
        "seed_treatment": "The Mahyco Chaitanya 7377 BG II seeds should be treated with recommended fungicides and insecticides to protect them from soil-borne diseases and pests.",
        "sowing": "The seeds of Mahyco Chaitanya 7377 BG II should be sown at a spacing of 67.5 x 45 cm, 2-3 seeds per hill, and a depth of 2-3 cm.",
        "irrigation": "Mahyco Chaitanya 7377 BG II requires regular irrigation, especially during the early growth stages. Irrigation should be done based on the soil and weather conditions.",
        "fertilizer_application": "A basal dose of 100 kg N, 50 kg P2O5, and 50 kg K2O per acre is recommended for Mahyco Chaitanya 7377 BG II. The fertilizers should be applied based on the soil test recommendations or as per the local recommendations.",
        "weed_control": "Weeds should be controlled manually or chemically with recommended herbicides.",
        "pesticides": "Pesticides should be used as per the recommendations for controlling bollworms, pink bollworms, and other pests.",
        "diseases": "Mahyco Chaitanya 7377 BG II is susceptible to diseases such as Fusarium wilt, Alternaria leaf spot, and Verticillium wilt. Proper disease management practices should be followed to prevent these diseases.",
        "harvesting": "Mahyco Chaitanya 7377 BG II cotton bolls should be harvested when they are mature and ready for picking, which usually starts around 145-150 days after sowing. The cotton should be stored in a cool and dry place after harvesting."
    },
    {
        "_id": "64036b82838fe82feec8b7ce",
        "crop": "64034c117a7b57f9573e7e1a",
        "name": "Paras Brahma bg 2",
        "short_info": "Paras Bramha BG 2 is a genetically modified Bt cotton variety developed by Paras Seeds Limited. It is known for its high yield potential, early maturity, and resistance to bollworms.",
        "avg_length": "3.5-4 feet.",
        "is_it_creeper": "No",
        "land_preparation": "The land for cultivating Paras Bramha BG 2 should be prepared by plowing, harrowing, and leveling. The soil should be well-drained, fertile, and rich in organic matter.",
        "seed_treatment": "The Paras Bramha BG 2 seeds should be treated with recommended fungicides and insecticides to protect them from soil-borne diseases and pests.",
        "sowing": "The seeds of Paras Bramha BG 2 should be sown at a spacing of 67.5 x 45 cm, 2-3 seeds per hill, and a depth of 2-3 cm.",
        "irrigation": "Paras Bramha BG 2 requires regular irrigation, especially during the early growth stages. Irrigation should be done based on the soil and weather conditions.",
        "fertilizer_application": "A basal dose of 100 kg N, 50 kg P2O5, and 50 kg K2O per acre is recommended for Paras Bramha BG 2. The fertilizers should be applied based on the soil test recommendations or as per the local recommendations.",
        "weed_control": "Weeds should be controlled manually or chemically with recommended herbicides.",
        "pesticides": "Pesticides should be used as per the recommendations for controlling bollworms, pink bollworms, and other pests.",
        "diseases": "Paras Bramha BG 2 is susceptible to diseases such as Fusarium wilt, Alternaria leaf spot, and Verticillium wilt. Proper disease management practices should be followed to prevent these diseases.",
        "harvesting": "Paras Bramha BG 2 cotton bolls should be harvested when they are mature and ready for picking, which usually starts around 145-150 days after sowing. The cotton should be stored in a cool and dry place after harvesting."
    },
    {
        "_id": "64036b82838fe82feec8b7cf",
        "crop": "64034c117a7b57f9573e7e1a",
        "name": "Bayer Sarpas First Class BG II",
        "short_info": "Bayer Sarpas First Class BG II is a variety of Bt cotton that is resistant to bollworms and other common pests.",
        "avg_length": "160-170 cm.",
        "is_it_creeper": "No",
        "land_preparation": "The land should be plowed and leveled properly. Soil testing should be done to determine the soil fertility status and nutrient requirements. The recommended soil pH range is 6.0 to 7.5.",
        "seed_treatment": "The seeds should be treated with recommended fungicides and insecticides to protect against pests and diseases.",
        "sowing": "Sow the seeds at a depth of 2-3 cm and a spacing of 60 cm between rows and 30 cm between plants. The best time for sowing is in the first week of June.",
        "irrigation": "Irrigation should be done at regular intervals, and the frequency and amount of water applied will depend on the soil type and weather conditions.",
        "fertilizer_application": "Apply fertilizer based on the soil test results and the crop's nutrient requirements. The recommended dose for nitrogen is 120 kg/ha, phosphorus is 60 kg/ha, and potassium is 40 kg/ha.",
        "weed_control": "Use of herbicides is recommended to control weeds. It is important to remove weeds from the field as they compete for nutrients and water with the cotton plants.",
        "pesticides": "Insect pests such as bollworms and sucking pests can cause significant damage to the crop, and appropriate pesticides should be used to control them.",
        "diseases": "Diseases like leaf spot and wilt can affect cotton crops, and appropriate measures should be taken to control them.",
        "harvesting": "Harvesting should be done when the cotton bolls are fully mature and have opened. Pick the cotton bolls by hand or use a cotton picker."
    },
    {
        "_id": "64036b82838fe82feec8b7d0",
        "crop": "64034c117a7b57f9573e7e1a",
        "name": "Green Gold Vitthal BG 2",
        "short_info": "Green Gold Vitthal BG 2 is a Bollgard II (BG2) variety of cotton, which means it has been genetically modified to produce its own insecticide and resist certain pests. This variety is known for its high yield potential and good fiber quality.",
        "avg_length": "The average length of the Green Gold Vitthal BG 2 cotton plant is around 4-5 feet.",
        "is_it_creeper": "No",
        "land_preparation": "Before sowing, the land should be ploughed to a depth of 6-8 inches and harrowed to obtain a fine seedbed. The soil should be well-drained and have good fertility.",
        "seed_treatment": "Seed treatment is an important practice in the cultivation of Green Gold Vitthal BG 2 cotton to protect the seeds from various pests and diseases and to ensure healthy plant growth. The following are some common seed treatment practices for this crop:\r\n\r\n1.Seed sorting and cleaning: Before treatment, the seeds should be sorted to remove damaged or diseased seeds, and any other foreign materials. The seeds are then cleaned to remove dust, debris, and other contaminants.\r\n\r\n2.Chemical treatment: The seeds are treated with a combination of fungicides and insecticides to protect against seed-borne diseases and pests. The choice of chemicals and their dosage depends on the severity of the pest and disease pressure in the growing area.\r\n\r\n3.Biological treatment: In some cases, biological agents such as beneficial bacteria and fungi can be used to protect the seeds and promote healthy plant growth.\r\n\r\n4.Nutrient treatment: The seeds can also be treated with nutrients such as micronutrients, growth promoters, and vitamins to enhance their germination, vigor, and overall plant growth.\r\n\r\nSeed treatment should be done carefully and according to recommended dosage to avoid damage to the seeds and to prevent any negative impact on the environment.",
        "sowing": "1.land preparation: The land should be cleared of any debris or unwanted vegetation, and the soil should be plowed to a depth of 15-20 cm. The soil should be well-drained, loose, and friable for good seed germination and root growth.\r\n\r\n2.Seed selection: High-quality seeds should be selected for sowing, and they should be treated with fungicides and insecticides to protect against pests and diseases.\r\n\r\n3 Seed rate: The recommended seed rate for Green Gold Vitthal BG 2 cotton is 8-10 kg/ha, and the spacing between rows should be around 75-90 cm.\r\n\r\n4 Sowing method: Sowing can be done either manually or using a mechanical planter. The seeds should be sown at a depth of 2-3 cm, and the soil should be gently pressed to ensure good seed-to-soil contact.",
        "irrigation": "The crop requires regular irrigation, especially during the flowering and boll development stages. Depending on the soil type and weather conditions, irrigation can be done through drip or furrow irrigation methods.",
        "fertilizer_application": "Green Gold Vitthal BG 2 cotton requires a balanced nutrient supply. Before sowing, apply well-rotted farmyard manure or compost at the rate of 10-12 tons per hectare. In addition, apply nitrogen, phosphorus, and potassium fertilizers as per the soil test recommendations.",
        "pesticides": "Since Green Gold Vitthal BG 2 cotton is genetically modified to produce its own insecticide, it may not require additional insecticide applications. However, if necessary, recommended insecticides can be used to control pests such as bollworm.",
        "diseases": "Green Gold Vitthal BG 2 is susceptible to various diseases, including:\r\n\r\n1.Bacterial blight: This disease is caused by the bacterium Xanthomonas campestris pv. malvacearum and can cause leaf spots, browning of stems, and premature defoliation. The disease spreads through rain splashes, irrigation water, and insect vectors.\r\n\r\n2.Fusarium wilt: This soil-borne disease is caused by the fungus Fusarium oxysporum f. sp. vasinfectum and can cause wilting, stunting, and yellowing of leaves. The disease spreads through contaminated soil, water, and infected plant debris.\r\n\r\n3.Verticillium wilt: This disease is caused by the fungus Verticillium dahliae and can cause yellowing, wilting, and premature defoliation. The disease spreads through contaminated soil, water, and infected plant debris.\r\n\r\n4.Cotton leaf curl virus: This viral disease is transmitted by whiteflies and can cause yellowing, curling, and deformation of leaves. Infected plants may also have stunted growth and reduced yield.\r\n\r\n5.To manage these diseases, farmers should adopt integrated pest management practices that include crop rotation, use of disease-resistant varieties, proper irrigation, and timely application of fungicides and insecticides. Regular monitoring of the crop for signs of disease is also important for early detection and prompt treatment.",
        "harvesting": "Harvesting of Green Gold Vitthal BG 2 cotton usually begins from 160 to 180 days after sowing, depending on the prevailing weather conditions and management practices. The cotton bolls should be picked at the right time to maximize yield and quality.\r\n\r\nHarvesting can be done manually or mechanically. In manual harvesting, cotton bolls are hand-picked by laborers, while in mechanical harvesting, specialized machines called cotton pickers are used to harvest the crop.\r\n\r\nAfter harvesting, the cotton bolls should be transported to a processing facility as soon as possible to prevent damage or deterioration of fiber quality. At the processing facility, the cotton fiber is separated from the seeds and other plant materials using ginning machines. The cotton fiber is then packed into bales and transported to textile mills for further processing.\r\n\r\nProper harvesting and post-harvest handling practices are important for maintaining the quality of the cotton fiber and maximizing the economic returns for the farmer."
    },
    {
        "_id": "64036b82838fe82feec8b7d1",
        "crop": "64034c117a7b57f9573e7e1a",
        "name": "Ajit 199 BG 2",
        "short_info": "Ajit 199 BG 2 is a Bt cotton variety. It has been developed to be resistant to a range of insect pests and diseases, including bollworms, leafhoppers, and wilt diseases.",
        "avg_length": "160-170 cm.",
        "is_it_creeper": "No",
        "land_preparation": "The land should be Cleared and plowed. Ths soil should have the PH range from 6.0 to 7.5",
        "seed_treatment": "seed treatment option for Ajit 199 BG 2 cotton is fungicide and insecticides seed treatment, which involves applying fungicides to the seeds to protect against soil-borne pathogens that can cause seed rot or seedling damping-off.",
        "sowing": "For Ajit 199 BG 2 cotton, drill sowing is often preferred, as it allows for more precise seed placement and better seed-to-soil contact. The seeds should be planted at a depth of around 1-2 inches, depending on soil moisture conditions.",
        "irrigation": "Irrigation methods that can be used for Ajit  199 BG 2 cotton, including furrow irrigation, drip irrigation, and overhead sprinkler irrigation. The choice of irrigation method will depend on factors such as soil type, water availability, and climate.",
        "fertilizer_application": "Apply fertilizer based on the soil test results and the crop's nutrient requirements. The recommended dose for nitrogen is 120 kg/ha, phosphorus is 60 kg/ha, and potassium is 40 kg/ha.",
        "weed_control": "Weeds should be controlled manually or chemically with recommended herbicides.",
        "pesticides": "Commonly used insecticides and pesticides for cotton include pyrethroids, organophosphates, and neonicotinoids.",
        "diseases": "Ajit 199 BG 2 cotton can be susceptible to a range of diseases, including fungal, bacterial, and viral infections.",
        "harvesting": "Harvesting should be done when the cotton bolls are fully mature and have opened. Pick the cotton bolls by hand or use a cotton picker."
    },
    {
        "_id": "64036b82838fe82feec8b7d2",
        "crop": "64034c117a7b57f9573e7e1a",
        "name": "Mallika NCS 207 BG III",
        "short_info": "Mallika NCS 207 BG III is a variety of Bt cotton that is resistant to bollworms and other common pests.",
        "avg_length": "150-160 cm.",
        "is_it_creeper": "No",
        "land_preparation": "The land should be plowed and leveled properly. Soil testing should be done to determine the soil fertility status and nutrient requirements. The recommended soil pH range is 6.0 to 7.5.",
        "seed_treatment": "The seeds should be treated with recommended fungicides and insecticides to protect against pests and diseases.",
        "sowing": "Sow the seeds at a depth of 2-3 cm and a spacing of 60 cm between rows and 30 cm between plants. The best time for sowing is in the first week of June.",
        "irrigation": "Irrigation should be done at regular intervals, and the frequency and amount of water applied will depend on the soil type and weather conditions.",
        "fertilizer_application": "Apply fertilizer based on the soil test results and the crop's nutrient requirements. The recommended dose for nitrogen is 120 kg/ha, phosphorus is 60 kg/ha, and potassium is 40 kg/ha.",
        "weed_control": "Use of herbicides is recommended to control weeds. It is important to remove weeds from the field as they compete for nutrients and water with the cotton plants.",
        "pesticides": "Insect pests such as bollworms and sucking pests can cause significant damage to the crop, and appropriate pesticides should be used to control them.",
        "diseases": "Diseases like leaf spot and wilt can affect cotton crops, and appropriate measures should be taken to control them.",
        "harvesting": "Harvesting should be done when the cotton bolls are fully mature and have opened. Pick the cotton bolls by hand or use a cotton picker."
    },
    {
        "_id": "64036b82838fe82feec8b7d3",
        "crop": "64034c117a7b57f9573e7e1a",
        "name": "Pranshi Goldi 333 BG III",
        "short_info": "Pranshi Goldi 333 BG III is a Bt cotton variety, which means it has been genetically modified to produce a toxin that is toxic to certain insect pests, such as bollworms.This can help to reduce pest damage and improve yields.",
        "avg_length": "28 to 32 mm",
        "is_it_creeper": "No",
        "land_preparation": "The land should be plowed and leveled properly. Soil testing should be done to determine the soil fertility status and nutrient requirements. The recommended soil pH range is 6.0 to 7.5.",
        "seed_treatment": "The seeds should be treated with recommended fungicides and insecticides to protect against pests and diseases.",
        "sowing": "Sow the seeds at a depth of 2-3 cm and a spacing of 60 cm between rows and 30 cm between plants. The best time for sowing is in the first week of June.",
        "irrigation": "Irrigation should be done at regular intervals, and the frequency and amount of water applied will depend on the soil type and weather conditions.",
        "fertilizer_application": "Apply fertilizer based on the soil test results and the crop's nutrient requirements. The recommended dose for nitrogen is 120 kg/ha, phosphorus is 60 kg/ha, and potassium is 40 kg/ha.",
        "weed_control": "Use of herbicides is recommended to control weeds. It is important to remove weeds from the field as they compete for nutrients and water with the cotton plants.",
        "pesticides": "Insect pests such as bollworms and sucking pests can cause significant damage to the crop, and appropriate pesticides should be used to control them.",
        "diseases": "Diseases like leaf spot and wilt can affect cotton crops, and appropriate measures should be taken to control them.",
        "harvesting": "Harvesting should be done when the cotton bolls are fully mature and have opened. Pick the cotton bolls by hand or use a cotton picker."
    }
]